run/tJunction/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0) //0
    (2 0 0)
    (3 0 0)
    (4 0 0)
    (4 2 0) //4
    (3 2 0)
    (3 5 0) //6
    (2 5 0)
    (2 2 0)
    (0 2 0)
    (0 0 1)
    (2 0 1)
    (3 0 1)
    (4 0 1)
    (4 2 1)
    (3 2 1)
    (3 5 1) //16
    (2 5 1)
    (2 2 1)
    (0 2 1)
);

blocks
(
    hex (0 1 8 9 10 11 18 19) (20 20 1) simpleGrading (1 1 1)
    hex (1 2 5 8 11 12 15 18) (10 20 1) simpleGrading (1 1 1)
    hex (2 3 4 5 12 13 14 15) (30 20 1) simpleGrading (1 1 1)
    hex (8 5 6 7 18 15 16 17) (10 20 1) simpleGrading (1 1 1)
);

boundary
(
/*
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
*/
);


// ************************************************************************* //
